#language: ru

Функционал: Поиск на Яндекс Афише

  Сценарий: Открываем главную страницую. Переходим в раздел Афиша. Ищем хорошее кино.

    Когда пользователь находится на странице "Главная страница"
    Тогда на странице присутствует "иконка Погода"
    Тогда на странице присутствует "раздел Афиша"
    И пользователь нажимает на "гиперссылка Афиша"

    Тогда пользователь перешел на страницу "Афиша"
    И вводит в поле "строка Поиска" текст "Зелёный слоник"
    И нажал на клавиатуре ENTER

    Тогда пользователь перешел на страницу "Афиша - Результаты поиска"
    И на странице присутствует "События в ближайшие дни"
    Тогда пользователь удаляет текст в поле "строка Поиска"
    И вводит в поле "строка Поиска" текст "Головаластик"
    И нажал на клавиатуре ENTER


